# XJTLU GMaster zR
nc: 14  # number of classes
depth_multiple: 1   # model depth multiple
width_multiple: 1   # layer channel multiple
anchors: [[], [], [],[]]
backbone:
  # [from,number,module,args]
  [ [-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
    [-1, 3, C2f, [128, True]],
    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
    [-1, 6, C2f, [256, True]],
    [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
    [-1, 6, C2f, [512, True]],
    [-1, 1, Conv, [512, 3, 2]],  # 7-P5/32
    [-1, 3, C2f, [512, True]],
    [-1, 1, Conv, [512, 3, 2]],  # 9-P6/64
    [-1, 3, C2f, [512, True]],
    [-1, 1, SPPFCSPC, [512, 5]]  # 11
]
head:
  [ [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 8], 1, Concat, [1]],  # cat backbone P5
    [-1, 3, C2, [512, False]],  # 14

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 6], 1, Concat, [1]],  # cat backbone P4
    [-1, 3, C2, [512, False]],  # 17

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 4], 1, Concat, [1]],  # cat backbone P3
    [-1, 3, C2, [256, False]],  # 20 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 17], 1, Concat, [1]],  # cat head P4
    [-1, 3, C2, [512, False]],  # 23 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 14], 1, Concat, [1]],  # cat head P5
    [-1, 3, C2, [512, False]],  # 26 (P5/32-large)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 11], 1, Concat, [1]],  # cat head P6
    [-1, 3, C2, [512, False]],  # 29 (P6/64-xlarge)
    [[20, 23, 26, 29], 1, V8Detect, [nc]]  # Detect(P3, P4, P5, P6)
]