# XJTLU GMaster zR
nc: 14  # number of classes
depth_multiple: 1   # model depth multiple
width_multiple: 1   # layer channel multiple

anchors:
  - [10,7, 16,13, 24,20, 38,31]                    #P2/4
  - [31, 45, 54,39, 52,56, 74,60]                  #P3/8
  - [71, 106, 101, 86, 138,112, 118,142]           #P4/16
  - [178,157, 134,269, 237,210, 389,311]           #P5/32

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],                      #0 CBSx4
   [-1, 1, Conv, [64, 3, 2]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [128, 3, 2]],

   [-1, 1, Conv, [64, 1, 1]],                      #ELAN_E
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],                     #11

   [-1, 1, MP, []],                                #MP3_C3
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],                     #16

   [-1, 1, Conv, [128, 1, 1]],                     #ELAN_E
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],                     #24

   [-1, 1, MP, []],                                #MP3_C3
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1]],                     #ELAN_E
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],                    #37

   [-1, 1, MP, []],                                #MP3_C3
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1]],                     #ELAN_E
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],                    #50
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]],                        #51

   [-1, 1, Conv, [256, 1, 1]],                     #CBS+Unsmample
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [37, 1, Conv, [256, 1, 1]],                     #route backbone P4
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1]],                     #ELAN_H
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],                     #63

   [-1, 1, Conv, [128, 1, 1]],                     #CBS+Unsmample
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [24, 1, Conv, [128, 1, 1]],                     #route backbone P3
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [128, 1, 1]],                     #ELAN_H
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],                     #75

   [-1, 1, Conv, [64, 1, 1]],                      #CBS+Unsmample
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [11, 1, Conv, [64, 1, 1]],                      #route backbone P2
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [64, 1, 1]],                      #ELAN_H
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [32, 3, 1]],
   [-1, 1, Conv, [32, 3, 1]],
   [-1, 1, Conv, [32, 3, 1]],
   [-1, 1, Conv, [32, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1]],                      #87

   [-1, 1, MP, []],                                #MP_C3
   [-1, 1, Conv, [64, 1, 1]],
   [-3, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 2]],

   [[-1, -3, 75], 1, Concat, [1]],

   [-1, 1, Conv, [128, 1, 1]],                    #ELAN_H
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],                    #100

   [-1, 1, MP, []],                               #MP_C3
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],

   [[-1, -3, 63], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1]],                   #ELAN_H
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],                   #113

   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 51], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],                   #ELAN_H
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],                   #126

   [87, 1, RepConv, [128, 3, 1]],
   [100, 1, RepConv, [256, 3, 1]],
   [113, 1, RepConv, [512, 3, 1]],
   [126, 1, RepConv, [1024, 3, 1]],

   [[127,128,129,130], 1, Detect, [nc, anchors]], #Detect(P2, P3, P4, P5)
  ]

