# XJTLU GMaster zR
nc: 14  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.5  # scales convolution channels
anchors:
  - [10,7, 16,13, 24,20, 38,31]                    #P2/4
  - [31, 45, 54,39, 52,56, 74,60]                  #P3/8
  - [71, 106, 101, 86, 138,112, 118,142]           #P4/16
  - [178,157, 134,269, 237,210, 389,311]           #P5/32
backbone:
  # [from,number,module,args]
  [ [-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
    [-1, 3, C2fHB, [128]],
    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
    [-1, 6, C2fHB, [256]],
    [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
    [-1, 6, C2fHB, [512]],
    [-1, 1, Conv, [512, 3, 2]],  # 7-P5/32
    [-1, 3, C2fHB, [512]],
]
head:
  [ [-1, 1, SPPFCSPC, [1024, 5]],

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 6], 1, Concat, [1]],  # cat backbone P4
    [-1, 3, C2fHB, [512]],  # 12

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 4], 1, Concat, [1]],  # cat backbone P3
    [-1, 3, C2fHB, [256]],  # 15 (P3/8-small)

    [ -1, 1, nn.Upsample,[None, 2, 'nearest' ]],
    [[-1, 2], 1, Concat,[1]],  # cat backbone P2
    [-1, 3, C2fHB, [128]],  # 18 (P3/8-small)
    [-1, 1, SimAM, [128]],

    [-1, 1, Conv, [128, 3, 2]],
    [[-1, 15], 1, Concat,[1]],  # cat head P3
    [-1, 3, C2fHB, [256]],  # 22 (P4/16-small)
    [-1, 1, SimAM, [256]],

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 12], 1, Concat, [1]],  # cat head P4
    [-1, 3, C2fHB, [512]],  # 26 (P4/16-medium)
    [-1, 1, SimAM, [512]],

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 9], 1, Concat, [1]],  # cat head P5
    [-1, 3, C2fHB, [1024]],  # 30 (P5/32-large)
    [-1, 1, SimAM, [1024]],

   [[18, 22, 26, 30], 1, Detect, [nc,anchors]]  # Detect(P3, P4, P5)
 ]
