# XJTLU GMaster zR
nc: 14  # number of classes
depth_multiple: 1   # model depth multiple
width_multiple: 1   # layer channel multiple

anchors: 4

backbone:
  # [from,number,module,args]
  [ [-1, 1, Conv, [32, 3, 1]],                     #0 CBSx4
    [-1, 1, Conv, [64, 3, 2]],
    [-1, 1, Conv, [64, 3, 1]],
    [-1, 1, Conv, [128, 3, 2]],

    [-1, 1, CNeB2, [128]],                          #HorNet with Conv
    [-1, 1, Conv, [256, 3, 2]],                    #5

    [-1, 1, MP, []],                               #MP_C3
    [-1, 1, Conv, [128, 1, 1]],
    [-3, 1, Conv, [128, 1, 1]],
    [-1, 1, Conv, [128, 3, 2]],
    [[-1, -3], 1, Concat, [1]],

    [-1, 1, CNeB2, [256]],
    [-1, 1, Conv, [512, 3, 1]],                    #12

    [-1, 1, MP, []],
    [-1, 1, Conv, [256, 1, 1]],
    [-3, 1, Conv, [256, 1, 1]],
    [-1, 1, Conv, [256, 3, 2]],
    [[-1, -3], 1, Concat, [1]],

    [-1, 1, CNeB2, [512]],
    [-1, 1, Conv, [1024, 3, 1]],                   #19

    [-1, 1, MP, []],
    [-1, 1, Conv, [512, 1, 1]],
    [-3 ,1, Conv, [512, 1, 1]],
    [-1, 1, Conv, [512, 3, 2]],
    [[-1, -3], 1, Concat, [1]],

    [-1, 1, CNeB2, [1024]],
    [-1, 1, Conv, [256, 3, 1]],                    #26
 ]

head:
  [ [-1, 1, SPPFCSPC, [512]],                      #27

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None,2,'nearest']],
    [19, 1, Conv, [256, 1, 1]],                    # route backbone P4
    [[-1, -2], 1, Concat, [1]],

    [-1, 1, CoT3, [128]],                          #32

    [-1, 1, Conv, [128, 1, 1]],
    [-1, 1, nn.Upsample, [None,2,'nearest']],
    [12, 1, Conv, [128, 1, 1]],                    # route backbone P3
    [[-1, -2], 1, Concat, [1]],

    [-1, 1, CoT3, [128]],                          #37

    [-1, 1, Conv, [64, 1, 1]],
    [-1, 1, nn.Upsample, [None,2,'nearest']],
    [5 , 1, Conv, [64, 1, 1]],                     # route backbone P2
    [[-1, -2], 1, Concat, [1]],
    [-1, 1, CoT3, [64]],                           #42

    [-1, 1, MP, []],
    [-1, 1, Conv, [64, 1, 1]],
    [-3, 1, SimAM, [64]],                          #SimAM
    [-1, 1, Conv, [64, 3, 2]],
    [[-1, -3, 37], 1, Concat, [1]],

    [-1, 3, CoT3, [128]],                          #48

    [-1, 1, MP, []],
    [-1, 1, Conv, [128, 1, 1]],
    [-3, 1, SimAM, [128]],
    [-1, 1, Conv, [128, 3, 2]],
    [[-1, -3, 32], 1, Concat, [1]],

    [-1, 1, CoT3, [256]],                          #54

    [-1, 1, MP, []],
    [-1, 1, Conv, [256,1, 1]],
    [ -3, 1, SimAM, [ 256 ] ],
    [-1, 1, Conv, [256,3, 2]],
    [[-1, -3, 27], 1, Concat, [1]],
    [-1, 3, CoT3, [512]],                          #60

    [42, 1, RepConv, [128, 3, 1]],
    [48, 1, RepConv, [256, 3, 1]],
    [54, 1, RepConv, [512, 3, 1]],
    [60, 1, RepConv, [1024, 3, 1]],

    [[61, 62, 63, 64],  1, V6Detect, [nc,anchors]],  #Detect(P2,P3,P4,P5)
 ]